STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_pwr.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    stm32g081b_eval_pwr.c
  * @author  MCD Application Team
  * @brief   This file provides a set of functions needed to manage the Type-C
  *          Power Delivery (PD):
  *            - VBUS control
  *            - VBUS voltage/current measurement
  *            - VCONN control
  *            - VBUS presence detection
  *            - DCDC voltage measurement (MB1352C only)
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2018 STMicroelectronics</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#if defined(_TRACE)||defined(_GUI_INTERFACE)
#define PWR_DEBUG
#endif /* _TRACE || _GUI_INTERFACE*/
#include "stm32g081b_eval.h"
#include "stm32g081b_eval_pwr.h"
#include "stm32g0xx_hal.h"
#include "stm32g0xx_ll_lptim.h"
#include "string.h"
#ifdef PWR_DEBUG
#include "usbpd_core.h"
#include "usbpd_trace.h"
#endif
/* USER CODE BEGIN include */
/* USER CODE END include */


/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32G081B_EVAL
  * @{
  */

/** @addtogroup STM32G081B_EVAL_POWER
  * @{
  */
/** @defgroup STM32G081B_EVAL_POWER_Private_Typedef Private Typedef
  * @{
  */
/* USER CODE BEGIN POWER_Private_Typedef */
/* Vref voltage level (in mV) */
#define VREFANALOG_VOLTAGE 3300

/**
  * @brief USB PD PPS values
  */
typedef enum
{
  VBUS_5_V         = 0u,
  VBUS_9_V         = 1u,
  VBUS_15_V        = 2u,
  VBUS_18_V        = 3u,
  VBUS_PPS_V       = 4u,
  VBUS_LEVEL_NB    = 5u
} VBUS_Level_TypeDef;

typedef enum
{
  ADC_VSENSE_1       = 0u,   /*< PB1  ADC used to get VBUS1 voltage level     */
  ADC_ISENSE_1       = 1u,   /*< PB10 ADC used to get VBUS1 curent value      */
  ADC_VSENSE_2       = 2u,   /*< PA3  ADC used to get VBUS2 voltage level     */
  ADC_ISENSE_2       = 3u,   /*< PB12 ADC used to get VBUS2 curent value      */
  ADC_VSENSE_DCDC    = 4u    /*< PB11 ADC used to get DCDC voltage level      */
} ADC_ChannelId_TypeDef;

typedef enum
{
  GPIO_SOURCE_EN        = 0u,   /*< PC6  Handle Source power Mos                                    */
  GPIO_VBUS_DISCHARGE1  = 1u,   /*< PB13 Handle Discharge Mos on VBUS1                              */
  GPIO_VBUS_DISCHARGE2  = 2u,   /*< PB14 Handle Discharge Mos on VBUS2                              */
  GPIO_VCONN_EN1        = 3u,   /*< PD4  Handle Vconn on VBUS1                                      */
  GPIO_VCONN_EN2        = 4u,   /*< PB9  Handle Vconn on VBUS2                                      */
  GPIO_VCONN_DISCHARGE1 = 5u,   /*< PA2  Handle Fast Role Swap on VBUS1 CC1 line or Vconn Discharge */
  GPIO_VCONN_DISCHARGE2 = 6u,   /*< PPB0 Handle Fast Role Swap on VBUS1 CC2 line or Vconn Discharge */
  GPIO_V_CTL1           = 7u,   /*< PC1   VBUS voltage level control                                */
  GPIO_V_CTL2           = 8u    /*< PB5 (Rev. A/B) or PA1 (Rev. C) VBUS voltage level control       */
} GPIO_Id_TypeDef;

typedef enum
{
  PORT_NOT_INITIALIZED = 0u,
    PORT_INITIALIZED
} PWR_PortStateTypedef;

typedef enum
{
  POWER_NONE,
  POWER_FIXED,
  POWER_VARIABLE,
  POWER_APDO
} PWR_Type;


typedef struct
{
    PWR_PortStateTypedef            State;
    USBPD_PWR_PowerRoleTypeDef      Role;
    uint32_t                        VBUSDisconnectionThreshold;
    USBPD_PWR_VBUSConnectionStatusTypeDef VBUSConnectionStatus;
    USBPD_PWR_VBUSDetectCallbackFunc *    pfnVBUSDetectCallback;
    PWR_Type                        Type;
    uint32_t                        VBUSVoltage;
} PortInfoTypeDef;


typedef struct
{
    uint8_t                         ADCRefCount;
    USBPD_PWR_DCDCCtrlModeTypeDef   DCDCCtrlMode;
    PortInfoTypeDef                 PortInfo[PWR_TYPEC_PORT_NB];
} ContextTypeDef;

/* USER CODE END POWER_Private_Typedef */
/**
  * @}
  */

/** @defgroup STM32G081B_EVAL_POWER_Private_Constants Private Constants
  * @{
  */
/* USER CODE BEGIN POWER_Private_Constants */

/* VDD voltage (in mv)*/
#define VDD 3300

/* Maximum digital value of the ADC output (12 Bits resolution)
   To converting ADC measurement to an absolute voltage value:
   VCHANNELx = ADCx_DATA x (VDD/ADC_FULL_SCALE)
*/
#define ADC_FULL_SCALE 0x0FFFu

/* VBUS connection detection voltage threshold (in mV) */
#define VBUS_CONNECTION_THRESHOLD 3000u

/* VBUS disconnection detection voltage threshold (in mV) */
#define VBUS_DISCONNECTION_THRESHOLD 2200u

/* Resistor voltage divider */
#define RA 330000u
#define RB  49900u

/* VBUS power source calibration parameters */
#define BSP_PWR_DCDC_POLL_TIME          1        /* DCDC polling periode in mS */
#define BSP_PWR_DCDC_MAX_PWM_VALUE      (3200u)   /* DCDC Vref: Max pwm min value 3.8V on RevB */
#define BSP_PWR_DCDC_MIN_PWM_VALUE      (1)      /* DCDC Vref: Max pwm max value 18V on RevB */
#define BSP_PWR_DCDC_MAX_PWM_STEP       (55)     /* DCDC Vref: Max pwm step = Full scale/25mS */
#define BSP_PWR_DCDC_MIN_PWM_STEP       (1)      /* DCDC Vref: Min pwm step */
#define BSP_PWR_DCDC_PLL_P_N            (9)      /* DCDC Coef P (0.xx)*/
#define BSP_PWR_DCDC_PLL_P_D            (9)      /* DCDC Coef P */
#define BSP_PWR_DCDC_PLL_D_N            (7)      /* DCDC Coef D (0.xx) */
#define BSP_PWR_DCDC_PLL_D_D            (8)      /* DCDC Coef D */

#define PWM_MAX_VALUES_LUT_PPS          131u

/* VBUS voltage level values (in mV) */
#define VBUS_VOLTAGE_0V_IN_MV   0u
#define VBUS_VOLTAGE_5V_IN_MV   5000u
#define VBUS_VOLTAGE_9V_IN_MV   9000u
#define VBUS_VOLTAGE_15V_IN_MV  15000u
#define VBUS_VOLTAGE_18V_IN_MV  18000u

/* VBUS sensing resume timout value (in ms)*/
#define VBUS_SENSING_RESUME_TIMEOUT     (1U)
/* USER CODE END POWER_Private_Constants */
/**
  * @}
  */

