STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_pwr.c
  BSP_USBPD_PWR_VBUSIsOn(Instance, &state);

  return state;
}

/**
  * @brief  Get actual VCONN status.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_CC1
  *         @arg TYPE_C_CC2
  * @retval VCONN status (1: On, 0: Off)
  */
uint8_t BSP_PWR_VCONNIsOn(uint32_t Instance,
                          uint32_t CCPinId)
{
  uint8_t state = 0;
  
  BSP_USBPD_PWR_VCONNIsOn(Instance, CCPinId, &state);

  return state;
}

/**
  * @brief  Get actual DCDC voltage level.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  * @retval DCDC voltage level (in mV)
  */
uint32_t BSP_PWR_DCDCGetVoltage(uint32_t Instance)
{
  uint32_t voltage = 0;

  /* DCDC measure is possible only if the port operates as a source */
  if (Context.PortInfo[Instance].Role != POWER_ROLE_SINK)
  {
    /* Pause VBUS sensing */
    PWR_PauseVBusSensing();

    /* Configure the ADC channel used to sense DCDC voltage */
    if (PWR_ADC_SetChannelConfig(ADC_VSENSE_DCDC) == 0)
    {
      /* Start conversion */
      if (HAL_ADC_Start(&hadc1) != HAL_OK)
      {
        goto end_of_DCDC_voltage_measure;
      }

      /* Wait for conversion completion */
      if (HAL_ADC_PollForConversion(&hadc1, 10) != HAL_OK)
      {
        goto end_of_DCDC_voltage_measure;
      }

      /* Translate ADC conversion into voltage level */
      voltage = PWR_ConvertADCDataToVoltage(HAL_ADC_GetValue(&hadc1));

      /* Stop conversion */
      if (HAL_ADC_Stop(&hadc1) != HAL_OK)
      {
        goto end_of_DCDC_voltage_measure;
      }

      /* Reset ADC channel configuration */
      PWR_ADC_ResetChannelConfig(ADC_VSENSE_DCDC);
    }

    /* Resume VBUS senging */
    PWR_ResumeVBusSensing();
  }

end_of_DCDC_voltage_measure:
  return voltage;
}

/**
  * @brief  Get DCDC control mode.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  * @retval DCDC control mode
  *         Returned value can take one of the following values:
  *         @arg DCDC_CTRL_MODE_UNKNOWN
  *         @arg DCDC_CTRL_MODE_GPIO
  *         @arg DCDC_CTRL_MODE_PWM
  */
PWR_DCDCCtrlModeTypeDef BSP_PWR_DCDCGetCtrlMode(uint32_t Instance)
{
  USBPD_PWR_DCDCCtrlModeTypeDef dcdc_ctrl = DCDC_CTRL_MODE_UNKNOWN;

  (void)BSP_USBPD_PWR_DCDCGetCtrlMode(Instance, &dcdc_ctrl);

  return (PWR_DCDCCtrlModeTypeDef)dcdc_ctrl;
}

/**
  * @}
  */

/** @addtogroup STM32G081B_EVAL_USBPD_POWER_Exported_Functions2
  * @{
  */

/**
  * @brief  Global initialization of PWR resource used by USB-PD
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_Init(uint32_t Instance)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_Init */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_Init */
}

/**
  * @brief  Global de-initialization of PWR resource used by USB-PD
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_Deinit(uint32_t Instance)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_Deinit */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_Deinit */
}

/**
  * @brief  Initialize the hardware resources used by the Type-C power delivery (PD)
  *         controller.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSInit(uint32_t Instance)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSInit */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    USBPD_PWR_PowerRoleTypeDef   role;

    if (Context.PortInfo[Instance].State == PORT_NOT_INITIALIZED)
    {
      if (Instance == USBPD_PWR_TYPE_C_PORT_1)
      {
        role = POWER_ROLE_DUAL;
        PWR_GPIO_Init(GPIO_VCONN_EN1);
        PWR_GPIO_Init(GPIO_VCONN_EN2);
      }
      else
      {
        role = POWER_ROLE_SINK;
      }

      /* SINK / SOURCE initialization order is important: in case of dual role
         SINK must be initialized before SOURCE. */
      if ((role == POWER_ROLE_SINK) || (role == POWER_ROLE_DUAL))
      {
        if (0u == PWR_InitSink())
        {
          if (Context.ADCRefCount == 1u)
          {
            if (0u != PWR_StartVBusSensing())
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
        }
        else
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
      }

      if ((BSP_ERROR_NONE == ret) &&
          ((role == POWER_ROLE_SOURCE) || (role == POWER_ROLE_DUAL)))
      {
        if (0u != PWR_InitSource(Instance))
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
      }

      /* Update PWR context */
      Context.PortInfo[Instance].State = PORT_INITIALIZED;
      Context.PortInfo[Instance].Role = role;
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VBUSInit */
}

/**
  * @brief  Release the hardware resources used by the Type-C power delivery (PD)
  *         controller.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSDeInit(uint32_t Instance)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSDeInit */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (Context.PortInfo[Instance].State == PORT_INITIALIZED)
    {
      if (Instance == USBPD_PWR_TYPE_C_PORT_1)
      {
        PWR_GPIO_DeInit(GPIO_VCONN_EN1);
        PWR_GPIO_DeInit(GPIO_VCONN_EN2);
      }

      if ((Context.PortInfo[Instance].Role == POWER_ROLE_SOURCE) ||
          (Context.PortInfo[Instance].Role == POWER_ROLE_DUAL))
      {
        if (0u != PWR_DeInitSource(Instance))
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
      }

