STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_pwr.c
    /* Set the power, the precision must be at 5% */
    ret = PWR_VBUSSetVoltage(Instance, vbus_target_inmv, (uint16_t)(vbus_target_inmv * 5u / 100u));

    /* Set the current limitation */
    /* not implemented */

  }
  return ret;
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSSetVoltage_Variable */
}

/**
  * @brief  Set a Battery PDO and manage the power control.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  VbusTargetMin the vbus Target min (in mV)
  * @param  VbusTargetMax the vbus Target max (in mV)
  * @param  OperatingPower the Operating Power (in mW)
  * @param  MaxOperatingPower the Max Operating Power (in mW)
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSSetVoltage_Battery(uint32_t Instance,
                                             uint32_t VbusTargetMin,
                                             uint32_t VbusTargetMax,
                                             uint32_t OperatingPower,
                                             uint32_t MaxOperatingPower)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSSetVoltage_Battery */
  /* Check if instance is valid       */
  int32_t ret;
  UNUSED(OperatingPower);
  UNUSED(VbusTargetMax);
  UNUSED(VbusTargetMin);
  UNUSED(MaxOperatingPower);

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Set the power, the precision must be at 5% */
    /* Set the current limitation */
    /* not implemented */

    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  return ret;
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSSetVoltage_Battery */
}

/**
  * @brief  Set a APDO and manage the power control.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  VbusTargetInmv the vbus Target (in mV)
  * @param  OperatingCurrent the Operating current (in mA)
  * @param  Delta Delta between with previous APDO (in mV), 0 means APDO start
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSSetVoltage_APDO(uint32_t Instance,
                                          uint32_t VbusTargetInmv,
                                          uint32_t OperatingCurrent,
                                          int32_t Delta)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSSetVoltage_APDO */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;
  UNUSED(Delta);
  UNUSED(OperatingCurrent);

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* set the new value with the current value */
    if (POWER_APDO != Context.PortInfo[Instance].Type)
    {
      switch (Context.PortInfo[Instance].VBUSVoltage)
      {
        case VBUS_VOLTAGE_0V_IN_MV :
        case VBUS_VOLTAGE_5V_IN_MV :
          aPWMDutyCycleLUT[VBUS_PPS_V] = aPWMDutyCycleLUT[VBUS_5_V];
          break;
        case VBUS_VOLTAGE_9V_IN_MV :
          aPWMDutyCycleLUT[VBUS_PPS_V] = aPWMDutyCycleLUT[VBUS_9_V];
          break;
        case VBUS_VOLTAGE_15V_IN_MV :
          aPWMDutyCycleLUT[VBUS_PPS_V] = aPWMDutyCycleLUT[VBUS_15_V];
          break;
        case VBUS_VOLTAGE_18V_IN_MV :
          aPWMDutyCycleLUT[VBUS_PPS_V] = aPWMDutyCycleLUT[VBUS_18_V];
          break;
        default:
          break;
      }
    }

    if (Context.PortInfo[Instance].VBUSVoltage != VbusTargetInmv)
    {
      /* Start VBUS Discharge, done to increase the decrease speed */
      PWR_GPIO_On(GPIO_VBUS_DISCHARGE1);

      ret = PWR_VBUSSetVoltage(Instance, VbusTargetInmv, USBPD_PWR_DCDC_PRECISION);
      /* Wait the power stabilization */
      PWR_GPIO_Off(GPIO_VBUS_DISCHARGE1);

      /* Upate the context */
      Context.PortInfo[Instance].VBUSVoltage = VbusTargetInmv;
      Context.PortInfo[Instance].Type = POWER_APDO;
    }

    /* Set the current limitation */
    /* not implemented */
  }
  return ret;
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSSetVoltage_APDO */
}

/**
  * @brief  Get actual voltage level measured on the VBUS line.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @param  pVoltage Pointer on measured voltage level (in mV)
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSGetVoltage(uint32_t Instance, uint32_t *pVoltage)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSGetVoltage */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if ((Instance >= USBPD_PWR_INSTANCES_NBR) || (NULL == pVoltage))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t voltage = 0u;


    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      voltage = PWR_ConvertADCDataToVoltage(aADCxConvertedValues[1u]);
    }
    else
    {
      if (Instance == USBPD_PWR_TYPE_C_PORT_2)
      {
        voltage = PWR_ConvertADCDataToVoltage(aADCxConvertedValues[0u]);
      }
    }

    *pVoltage = voltage;
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VBUSGetVoltage */
}

/**
  * @brief  Get actual current level measured on the VBUS line.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @param  pCurrent Pointer on measured current level (in mA)
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSGetCurrent(uint32_t Instance, int32_t *pCurrent)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSGetCurrent */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if ((Instance >= USBPD_PWR_INSTANCES_NBR) || (NULL == pCurrent))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    int32_t current = 0;

    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      current = PWR_ConvertADCDataToCurrent(aADCxConvertedValues[2u]);
    }
    else
    {
      if (Instance == USBPD_PWR_TYPE_C_PORT_2)
      {
        current = PWR_ConvertADCDataToCurrent(aADCxConvertedValues[3u]);
      }
    }

    *pCurrent = current;
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VBUSGetCurrent */
}

/**
  * @brief  Initialize VCONN sourcing.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNInit(uint32_t Instance,
                                uint32_t CCPinId)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VCONNInit */
  /* Check if instance is valid       */
  int32_t ret;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ret = BSP_ERROR_NO_INIT;

    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      switch (CCPinId)
      {
        case USBPD_PWR_TYPE_C_CC1 :
        {
          PWR_GPIO_Init(GPIO_VCONN_DISCHARGE1);
          ret = BSP_ERROR_NONE;
          break;
        }
        case USBPD_PWR_TYPE_C_CC2 :
        {
          PWR_GPIO_Init(GPIO_VCONN_DISCHARGE2);
          ret = BSP_ERROR_NONE;
          break;
        }
        default:
          break;
      }
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VCONNInit */
}

/**
  * @brief  Un-Initialize VCONN sourcing.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNDeInit(uint32_t Instance,
                                  uint32_t CCPinId)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VCONNDeInit */
  /* Check if instance is valid       */
  int32_t ret;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ret = BSP_ERROR_NO_INIT;

    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      switch (CCPinId)
      {
        case USBPD_PWR_TYPE_C_CC1 :
        {
          PWR_GPIO_DeInit(GPIO_VCONN_DISCHARGE1);
          ret = BSP_ERROR_NONE;
          break;
        }
        case USBPD_PWR_TYPE_C_CC2 :
        {
          PWR_GPIO_DeInit(GPIO_VCONN_DISCHARGE2);
          ret = BSP_ERROR_NONE;
          break;
        }
        default:
          break;
      }
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VCONNDeInit */
}

/**
  * @brief  Enable VCONN sourcing.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNOn(uint32_t Instance,
                              uint32_t CCPinId)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VCONNOn */
  /* Check if instance is valid       */
  int32_t ret;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ret = BSP_ERROR_PERIPH_FAILURE;

    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      if (CCPinId == USBPD_PWR_TYPE_C_CC1)
      {
        PWR_GPIO_On(GPIO_VCONN_EN1);
        ret = BSP_ERROR_NONE;
      }
      else
      {
        if (CCPinId == USBPD_PWR_TYPE_C_CC2)
        {
          PWR_GPIO_On(GPIO_VCONN_EN2);
          ret = BSP_ERROR_NONE;
        }
      }
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VCONNOn */
}

/**
  * @brief  Disable VCONN sourcing.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @param  CCPinId CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNOff(uint32_t Instance,
                               uint32_t CCPinId)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VCONNOff */
  /* Check if instance is valid       */
  int32_t ret;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ret = BSP_ERROR_PERIPH_FAILURE;

    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      if (CCPinId == USBPD_PWR_TYPE_C_CC1)
      {
        /* switch off Vconn */
        PWR_GPIO_Off(GPIO_VCONN_EN1);
        PWR_GPIO_On(GPIO_VCONN_EN1);
        PWR_GPIO_Off(GPIO_VCONN_EN1);

        /* Dicharge VCONN */
        PWR_GPIO_On(GPIO_VCONN_DISCHARGE1);
        HAL_Delay(1u);
        PWR_GPIO_Off(GPIO_VCONN_DISCHARGE1);
        ret = BSP_ERROR_NONE;
      }
      else
      {
        if (CCPinId == USBPD_PWR_TYPE_C_CC2)
        {
          /* switch off Vconn */
          PWR_GPIO_Off(GPIO_VCONN_EN2);
          PWR_GPIO_On(GPIO_VCONN_EN2);
          PWR_GPIO_Off(GPIO_VCONN_EN2);

          /* Dicharge VCONN */
          PWR_GPIO_On(GPIO_VCONN_DISCHARGE2);
          HAL_Delay(1u);
          PWR_GPIO_Off(GPIO_VCONN_DISCHARGE2);
          ret = BSP_ERROR_NONE;
        }
      }
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VCONNOff */
}

/**
  * @brief  Get actual VCONN status.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @param  pState VCONN status (1: On, 0: Off)
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNIsOn(uint32_t Instance,
                                uint32_t CCPinId, uint8_t *pState)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VCONNIsOn */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

