STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_pwr.c
  if ((Instance >= USBPD_PWR_INSTANCES_NBR) || (NULL == pState))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    GPIO_Id_TypeDef gpio;

    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      if (CCPinId == USBPD_PWR_TYPE_C_CC1)
      {
        gpio = GPIO_VCONN_EN1;
      }
      else
      {
        gpio = GPIO_VCONN_EN2;
      }
      ((READ_BIT(GPIO_PORT[gpio]->ODR, GPIO_PIN[gpio]) == GPIO_PIN[gpio]) ? (*pState = 1u) : (*pState = 0u));
    }
    else
    {
      ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;;
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VCONNIsOn */
}

/**
  * @brief  Set the VBUS disconnection voltage threshold.
  * @note   Callback funtion registered through BSP_USBPD_PWR_RegisterVBUSDetectCallback
  *         function call is invoked when VBUS falls below programmed threshold.
  * @note   By default VBUS disconnection threshold is set to 3.3V
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @param  VoltageThreshold VBUS disconnection voltage threshold (in mV)
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_SetVBUSDisconnectionThreshold(uint32_t Instance,
                                                    uint32_t VoltageThreshold)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_SetVBUSDisconnectionThreshold */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Update PWR context */
    if (VoltageThreshold <= VBUS_CONNECTION_THRESHOLD)
    {
      Context.PortInfo[Instance].VBUSDisconnectionThreshold = VoltageThreshold;
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_SetVBUSDisconnectionThreshold */
}

/**
  * @brief  Register USB Type-C Current callback function.
  * @note   Callback function invoked when VBUS rises above 4V (VBUS present) or
  *         when VBUS falls below programmed threshold (VBUS absent).
  * @note   Callback funtion is un-registered when callback function pointer
  *         argument is NULL.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_2
  * @param  pfnVBUSDetectCallback callback function pointer
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_RegisterVBUSDetectCallback(uint32_t                       Instance,
                                                 USBPD_PWR_VBUSDetectCallbackFunc    *pfnVBUSDetectCallback)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_RegisterVBUSDetectCallback */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if ((Instance >= USBPD_PWR_INSTANCES_NBR) || (NULL == pfnVBUSDetectCallback))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ADC_AnalogWDGConfTypeDef adc_awd_config;

    /* Configure analog watchdow */
    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      adc_awd_config.WatchdogNumber = ADC_ANALOGWATCHDOG_1;
      adc_awd_config.Channel        = ADCx_CHANNEL_VSENSE_1;
    }
    else 
    { 
      adc_awd_config.WatchdogNumber = ADC_ANALOGWATCHDOG_2;
      adc_awd_config.Channel        = ADCx_CHANNEL_VSENSE_2;
    }
    /* Update PWR context */
    Context.PortInfo[Instance].pfnVBUSDetectCallback = pfnVBUSDetectCallback;

    if (pfnVBUSDetectCallback == NULL)
    {
      adc_awd_config.WatchdogMode  = ADC_ANALOGWATCHDOG_NONE;
      adc_awd_config.ITMode        = DISABLE;
      adc_awd_config.HighThreshold = 0xFFF;
      adc_awd_config.LowThreshold  = 0u;
    }
    else
    {
      adc_awd_config.WatchdogMode  = ADC_ANALOGWATCHDOG_SINGLE_REG;
      adc_awd_config.ITMode        = ENABLE;
      adc_awd_config.HighThreshold = PWR_ConvertVoltageToThreshold(VBUS_CONNECTION_THRESHOLD);
      adc_awd_config.LowThreshold  = 0u;
    }

    /* Stop on-going conversions */
    if (HAL_ADC_Stop_DMA(&hadc1) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      /* Set AWD configuration */
      if (HAL_ADC_AnalogWDGConfig(&hadc1, &adc_awd_config) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* Resume conversions */
        if (HAL_ADC_Start_DMA(&hadc1, (uint32_t *)aADCxConvertedValues, 4u) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
      }
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_RegisterVBUSDetectCallback */
}

/**
  * @brief  Get actual VBUS status.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  pState VBUS status (1: On, 0: Off)
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSIsOn(uint32_t Instance, uint8_t *pState)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSIsOn */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      *pState = ((READ_BIT(GPIO_PORT[GPIO_SOURCE_EN]->ODR, GPIO_PIN[GPIO_SOURCE_EN]) == GPIO_PIN[GPIO_SOURCE_EN]) ? 1u : 0u);
    }
    else
    {
      ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;;
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VBUSIsOn */
}

/**
  * @brief  Get DCDC control mode.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  pDCDCCtrl Pointer on DCDC control mode
  *         Returned value can take one of the following values:
  *         @arg @ref DCDC_CTRL_MODE_UNKNOWN
  *         @arg @ref DCDC_CTRL_MODE_GPIO
  *         @arg @ref DCDC_CTRL_MODE_PWM
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_DCDCGetCtrlMode(uint32_t Instance, USBPD_PWR_DCDCCtrlModeTypeDef *pDCDCCtrl)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_DCDCGetCtrlMode */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

