STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_pwr.c
  if (Instance == TYPE_C_PORT_1)
  {

    PWR_GPIO_On(GPIO_VBUS_DISCHARGE1);
    /* Disable DCDC_EN bit*/
    PWR_GPIO_Off(GPIO_V_CTL2);

    /* Wait Tempo or Voltage level */
    if (Delay > 0u)
    {
      HAL_Delay(Delay);
    }
    else /* if (VbusErrorInmV > 0) */
    {

      do{
        HAL_Delay(1);
        vbus = BSP_PWR_VBUSGetVoltage(Instance);
        if ((0 == vbus_disable) && (vbus < 5000))
        {
          /* Switch off VBUS */
          PWR_GPIO_Off(GPIO_SOURCE_EN);
          vbus_disable = 1u;
        }
      }
      while (vbus >= (VbusStopInmV + VbusErrorInmV));
    }

    /* Enable DCDC_EN bit*/
    PWR_GPIO_On(GPIO_V_CTL2);
    PWR_GPIO_Off(GPIO_VBUS_DISCHARGE1);
    /* Allow to restart with correct duty cycle */
    PWR_SetPWMDutyCycle(aPWMDutyCycleLUT[VBUS_5_V]);
  }
}

/**
   * @brief  Set VBUS voltage level
   * @param  Instance Type-C port identifier
   *         This parameter can be take one of the following values:
   *         @arg TYPE_C_PORT_1
   *         @arg TYPE_C_PORT_2
   * @param  VBusInmV  VBUS voltage level setpoint(in mV)
   * @param  Precision Requested precision (in mV)
   * @note  Calibration and Precision paremeters aren't relevant when the VBUS
   *        voltage level isn't controlled by a PWM signal.
   * @note  When VBUS voltage level is controlled by a PWM signal, VBUS voltage is
   *        controlled by a PD (Proportional-Derivative) control loop.
   *        The PD control implementation is ilustrated by the block diagram below:
   *
   *                                              .-------------------.
   *                 .-------.              .------> PROPORTIONAL (Kp) >-.   .-------.
   *                 |  ADD  | pwm_error    |      '-------------------'  |  |  ADD  |  pwm  .---------------.
   *    VBusInmV --> +       >--------------|                             '--> +     >-------> PWM generator >-.
   *                 |       |              |     .------------------.       |       |       '---------------' |
   * vbus_measured .-> -     |              '----->  DERIVATIVE (Kd) >-------> +     |                         |
   *               | '-------'  pwm_error_previous ->                  |       '-------'                         |
   *               |                              '------------------'                                         |
   *               '-------------------------------------------------------------------------------------------'
   *
   *   pwm = Kp * pwm_error + (Kd * der)
   *
   * where:
   *  pwm_error is calulated from vbus_error
   *  Kp = Proptional Constant.
   *  Kd = Derivative Constant.
   *  der  = pwm_error - pwm_error_previous
  *  (der: differential error)
  */
static PWR_StatusTypeDef PWR_VBUSSetVoltage(uint32_t Instance,
                                                uint32_t VBusInmV,
                                                uint16_t Precision)
{
  static uint8_t aPWMDutyCalibrated[VBUS_LEVEL_NB] =
  {
    0x0,   /* 5V */
    0x0,   /* 9V */
    0x0,   /* 15V */
    0x0,   /* 18V */
    0x0    /* Will be used to store latest PPS request */
  };
  
  PWR_StatusTypeDef _retr = PWR_OK;
  static uint16_t          duty_cycle;
  uint8_t           duty_calibrated = 0;
  uint32_t          vbus_measured;
#if defined(_TRACE)
  char _str[20];
#endif
  
  if (Instance == TYPE_C_PORT_1)
  {
    duty_cycle =  PWR_GetPWMDutyCycle();
    switch (VBusInmV)
    {
    case VBUS_VOLTAGE_0V_IN_MV:
      {
        duty_cycle    = 0x10u;
        /* Set PWM duty cycle to its initial value */
        PWR_SetPWMDutyCycle(duty_cycle);
        return PWR_OK;
      }
      
    case VBUS_VOLTAGE_5V_IN_MV:
      duty_cycle      = aPWMDutyCycleLUT[VBUS_5_V];
      duty_calibrated = aPWMDutyCalibrated[VBUS_5_V];
      break;
    case VBUS_VOLTAGE_9V_IN_MV:
      duty_calibrated = aPWMDutyCalibrated[VBUS_9_V];
      if (1u == duty_calibrated )
      {
        duty_cycle = aPWMDutyCycleLUT[VBUS_9_V];
      }
      break;
    case VBUS_VOLTAGE_15V_IN_MV:
      duty_calibrated = aPWMDutyCalibrated[VBUS_15_V];
      if (1u == duty_calibrated )
      {
        duty_cycle = aPWMDutyCycleLUT[VBUS_15_V];
      }
      break;
    case VBUS_VOLTAGE_18V_IN_MV:
      duty_cycle      = aPWMDutyCycleLUT[VBUS_18_V];
      if (1u == duty_calibrated )
      {
        duty_cycle = aPWMDutyCycleLUT[VBUS_18_V];
      }
      break;
    default:
      duty_cycle    = aPWMDutyCycleLUT[VBUS_PPS_V];
      duty_calibrated = 0u;
      break;
    }
    
#if defined(_TRACE)
    sprintf(_str,"==%d::%d",duty_cycle,duty_calibrated);
    USBPD_TRACE_Add(USBPD_TRACE_DEBUG,0,0,(uint8_t*)_str, strlen(_str));
#endif
    
#if defined(DBG_LOG)
    _DbgLogIndex=0;
#endif /* DBG_LOG */
    
    if (duty_calibrated == 1u)
    {
      uint32_t _tickstart = HAL_GetTick();
      PWR_SetPWMDutyCycle(duty_cycle);
      
      /* Check if the voltage is at the expected level */
      do
      {
        vbus_measured  = BSP_PWR_VBUSGetVoltage(Instance);
        for(int32_t index=0; index < 2000; index++)
        {
          __DSB();
        };
#ifdef PWR_DEBUG
        sprintf(_str,"svcc:%ld:%d", vbus_measured, duty_cycle);
        USBPD_TRACE_Add(USBPD_TRACE_DEBUG, Instance, 0, (uint8_t*)_str, strlen(_str));
#endif
        /* timeout to avoid infinite loop in case of power default */
        if ((HAL_GetTick() - _tickstart) > 300u)
        {
          /* discard the VBUS and return an error */
          BSP_PWR_VBUSOff(Instance);
          return PWR_ERROR;
        }
      }
      while ((ABS(vbus_measured - VBusInmV)) > 200u);
    }
    else
    {
      int32_t           vbus_error;
      int32_t           vbus_previous;
      int32_t           pwm;
      int32_t           pwm_step_current;
      int32_t           pwm_step_previous;
      int32_t           pwm_error = 0u;
      int32_t           pwm_error_previous;
      uint8_t            nb_pll_loop;
      pwm_step_previous = 0u;
      pwm_step_current = duty_cycle;
      vbus_previous = vbus_measured = 0u;
      nb_pll_loop = 0u;
      
      do
      {
        pwm_step_previous = pwm_step_current;
        vbus_previous = vbus_measured;
        pwm_error_previous = pwm_error;
        pwm_error = 0;
        pwm = 0;
        
        PWR_SetPWMDutyCycle(duty_cycle);
        
        /* We can not avoid this DCDC takes time to lock .... */
        for(int32_t index=0; index < 7000; index++)
        {
          __DSB();
        };
        
        /* Measure actual VBUS voltage level */
        vbus_measured  = BSP_PWR_VBUSGetVoltage(Instance);
#if 0
        sprintf(_str,"sv:%d:%d", vbus_measured, duty_cycle);
        USBPD_TRACE_Add(USBPD_TRACE_DEBUG, Instance, 0, (uint8_t*)_str, strlen(_str));
#endif
        /* Protection to handle the case where power is not present */
        if(vbus_measured < 300u)
        {
          /* discard the VBUS and return an error */
          BSP_PWR_VBUSOff(Instance);
          return PWR_ERROR;
        }
        
        /* Calculate VBUS error = target - the measure */
        vbus_error = (int32_t)(VBusInmV) - (int32_t)(vbus_measured);
        
        /* Convert VBUS error into PWM error (pwm_error) */
        if ((ABS(vbus_error) >= BSP_PWR_DCDC_PRECISION))
        {
          /* Calculate PWM error */
          pwm_error = (1000 * duty_cycle) / vbus_measured;
          pwm_error *= vbus_error;
          pwm_error /= 1000;
          
          /* Calculate new PWM setpoint */
          pwm = pwm_error*(int32_t)BSP_PWR_DCDC_PLL_P_N;
          pwm /= (int32_t)BSP_PWR_DCDC_PLL_P_D;
          pwm += (((pwm_error)-(pwm_error_previous))*(int32_t)BSP_PWR_DCDC_PLL_D_N)/((int32_t)BSP_PWR_DCDC_PLL_D_D);
        }
        
        /* Set PWM setpoint to its min value (if min DCDC capabilities is reached) */
        if (pwm == 0)
        {
          if (vbus_error > 0)
          {
            pwm = (int32_t)BSP_PWR_DCDC_MIN_PWM_STEP;
          }
          else
          {
            pwm = -(int32_t)BSP_PWR_DCDC_MIN_PWM_STEP;
          }
        }
        /* Limit PWM setpoint to max value (if required) */
        else if (ABS(pwm) >= (uint32_t)BSP_PWR_DCDC_MAX_PWM_STEP)
        {
          if (pwm > 0)
          {
            pwm = (int32_t)BSP_PWR_DCDC_MAX_PWM_STEP;
          }
          else
          {
            pwm = -(int32_t)BSP_PWR_DCDC_MAX_PWM_STEP;
          }
        }
        
        /* Calculate duty cycle setpoint from PWM setpoint */
        if (pwm > 0)
        {
          if ((duty_cycle + (uint32_t)(pwm)) <= (uint32_t)BSP_PWR_DCDC_MAX_PWM_VALUE)
          {
            duty_cycle += (uint32_t)ABS(pwm);
          }
          else
          {
            /* Error case: Go back to 5V or 0V and break? */
          }
        }
        else
        {
          if ((duty_cycle - (uint32_t)(pwm)) > (uint32_t)BSP_PWR_DCDC_MIN_PWM_VALUE)
          {
            duty_cycle -= (uint32_t)ABS(pwm);
          }
        }
        
        pwm_step_current = duty_cycle;
        
#if defined(DBG_LOG)
        _Err[_DbgLogIndex]=vbus_error;
        _Pwm[_DbgLogIndex]=duty_cycle;
        _PwmE[_DbgLogIndex]=pwm;
        _DbgLogIndex++;
        if (_DbgLogIndex >= sizeof(_vbusout) / 4)
        {
          _DbgLogIndex=0;
        }
#endif /* DBG_LOG*/
        
        if (    (ABS((int16_t)pwm_step_current-(int16_t)pwm_step_previous) <= BSP_PWR_DCDC_MIN_PWM_STEP)
            && ((ABS(((int32_t)vbus_measured - (int32_t)vbus_previous))) <= BSP_PWR_DCDC_PRECISION)
              && (ABS(vbus_error) <= Precision))
          
        {
          nb_pll_loop++;
        }
        else
        {
          nb_pll_loop = 0u;
        }
      }
      while (nb_pll_loop < 1u);
      
      /* save the PWM value for the next settings */
      switch (VBusInmV)
      {
      case VBUS_VOLTAGE_0V_IN_MV:
        break;
      case VBUS_VOLTAGE_5V_IN_MV:
        {
          aPWMDutyCycleLUT[VBUS_5_V]  = duty_cycle;
          aPWMDutyCalibrated[VBUS_5_V] = 1u;
#if defined(_TRACE)
          sprintf(_str, "ca5V:%d", duty_cycle);
          USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
          break;
        }
      case VBUS_VOLTAGE_9V_IN_MV:
        {
          aPWMDutyCycleLUT[VBUS_9_V]  = duty_cycle;
          aPWMDutyCalibrated[VBUS_9_V] = 1u;
#if defined(_TRACE)
          sprintf(_str, "ca9V:%d", duty_cycle);
          USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
          break;
        }
      case VBUS_VOLTAGE_15V_IN_MV:
        {
          aPWMDutyCycleLUT[VBUS_15_V] = duty_cycle;
          aPWMDutyCalibrated[VBUS_15_V] = 1u;
#if defined(_TRACE)
          sprintf(_str, "ca15V:%d", duty_cycle);
          USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
          break;
        }
      case VBUS_VOLTAGE_18V_IN_MV:
        {
          aPWMDutyCycleLUT[VBUS_18_V] = duty_cycle;
          aPWMDutyCalibrated[VBUS_18_V] = 1u;
#if defined(_TRACE)
          sprintf(_str, "ca18V:%d", duty_cycle);
          USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
          break;
        }
      default:
        {
          aPWMDutyCycleLUT[VBUS_PPS_V] = duty_cycle;
#if defined(_TRACE)
          sprintf(_str, "ca1PPS:%d", duty_cycle);
          USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif        
          break;
        }
      }
    }
  }
  else
  {
    _retr = PWR_ERROR;
  }
  
  return _retr;
}

/**
 * @brief  Start I/V sense on both Type-C ports.
 * @retval 0 success else fail
 */
static uint8_t PWR_StartVBusSensing(void)
{
  uint8_t ret = 0u;

  /* Start ADCx conversions */
  if (HAL_ADC_Start_DMA(&hadc1, (uint32_t *)aADCxConvertedValues, 4u) != HAL_OK)
  {
    ret++;
  }

  return ret;
}

/**
 * @brief  Stop I/V sense on both Type-C ports.
 * @retval 0 success else fail
 */
static uint8_t PWR_StopVBusSensing(void)
{
  uint8_t ret = 0u;

  /* Stop ADCx conversions */
  if (HAL_ADC_Stop_DMA(&hadc1) != HAL_OK)
  {
    ret++;
  }

  VBUSSensingCompleted = 0u;

  return ret;
}

/**
 * @brief  Pause I/V sense on both Type-C ports.
 * @retval 0 success else fail
 */
static uint8_t PWR_PauseVBusSensing(void)
{
  uint8_t ret = 0u;

  /* Stop on-going conversions */
  if (HAL_ADC_Stop_DMA(&hadc1) != HAL_OK)
  {
    ret++;
  }

  /* Reset Channel selection register */
  hadc1.Instance->CHSELR &= ~(ADC_CHSELR_SQ_ALL);

  VBUSSensingCompleted = 0u;

  return ret;
}

/**
 * @brief  Resume I/V sense on both Type-C ports.
 * @retval 0 success else fail
 */
static uint8_t PWR_ResumeVBusSensing(void)
{
  uint8_t  ret = 0u;
  uint32_t tickstart;

  /* Reset Channel selection register */
  hadc1.Instance->CHSELR &= ~(ADC_CHSELR_SQ_ALL);

